app/controllers/contacts_controller.rb

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 1 LIMIT 1
SELECT `smtpsettings`.* FROM `smtpsettings` WHERE `smtpsettings`.`account_id` = 1 LIMIT 1
---
	def new
		if current_user.account && current_user.account.smtpsetting.present? && current_user.account.imapsetting.present?

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 1 LIMIT 1
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`account_id` = 1 ORDER BY id ASC LIMIT 1 OFFSET 0
---
	def index
		 @contacts = Contact.order("id ASC").page(params[:page]).per_page(5)
		# @contacts = current_user.account && current_user.account.contacts && current_user.account.contacts.order("id ASC").page(params[:page]).per_page(5)
		@contacts = current_user.account && current_user.account.contacts && current_user.account.contacts.order("id ASC").page(params[:page])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 0 LIMIT 1
---
	def show
		if current_user
		    @contact = Contact.find(params[:id])