app/controllers/plans_controller.rb

	def index
			@constant_plans = Constantplan.all
			@current_plan = current_user.account && current_user.account.plan#Plan.find_by_account_id(current_user.account.id)
---
SELECT `constantplans`.* FROM `constantplans`
SELECT `plans`.* FROM `plans` WHERE `plans`.`account_id` = 1 LIMIT 1