app/controllers/users_controller.rb

UPDATE `users` SET `email` = 'alur@mvs.net.ua', `updated_at` = '2015-01-02 18:27:57' WHERE `users`.`id` = 1
---
	def add_email
    if params[:user] && params[:user][:email]
      current_user.email = params[:user][:email]
      # current_user.skip_reconfirmation! # don't forget this if using Devise confirmable

      # redirect_to :index

      respond_to do |format|
        if current_user.save